hollowwave/BitRot/esp32-wroom-radio/sdkconfig.defaults
# Target: classic ESP32 WROOM (not S3)
CONFIG_IDF_TARGET="esp32"

# Flash: 4MB (standard WROOM)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Wi-Fi + BT coexistence (BT reserved for v1.2)
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
